rails/byte_size_news/app/controllers/news/search_controller.rb

    def search_feed
      @issues = Issue.search(params[:query])
      @groups = Group.search(params[:query])
---
SELECT "issues".* FROM "issues" WHERE (lower(content) LIKE '%SEMO %' OR lower(title) LIKE '%SEMO %')
SELECT "groups".* FROM "groups" WHERE (lower(group_name) LIKE '%a%' OR active_members OR lower(sub_genre) OR boy_band LIKE '%a%')