rails/byte_size_news/app/views/news/search/search_feed.html.erb

SELECT "groups".* FROM "groups" WHERE (lower(group_name) LIKE '%a%' OR active_members OR lower(sub_genre) OR boy_band LIKE '%a%')
---
<% @groups.each do |group| %>
  <h2>Group: <%= group.group_name %></h2>